#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu Feb 20 11:55:58 2025

set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_fic "D:/Downloads/pg2l200/2_Demo/3_2_HDMI_IN_DDR3_YCbCr/3_2_HDMI_IN_DDR3_YCbCr/HDMI_IN_DDR3_YCbCr/synthesize/HDMI_IN_DDR3_YCbCr_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
remove_fic "D:/Downloads/pg2l200/2_Demo/3_2_HDMI_IN_DDR3_YCbCr/3_2_HDMI_IN_DDR3_YCbCr/HDMI_IN_DDR3_YCbCr/synthesize/HDMI_IN_DDR3_YCbCr_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "C:/Users/Administrator/Desktop/3_2_HDMI_IN_DDR3_YCbCr/3_2_HDMI_IN_DDR3_YCbCr/HDMI_IN_DDR3_YCbCr/source/hdmi/outputserdes.v"
add_design "C:/Users/Administrator/Desktop/3_2_HDMI_IN_DDR3_YCbCr/3_2_HDMI_IN_DDR3_YCbCr/HDMI_IN_DDR3_YCbCr/source/hdmi/rgb2tmds.v"
add_design "C:/Users/Administrator/Desktop/3_2_HDMI_IN_DDR3_YCbCr/3_2_HDMI_IN_DDR3_YCbCr/HDMI_IN_DDR3_YCbCr/source/hdmi/tmds_encoder.v"
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_fic "C:/Users/Administrator/Desktop/3_2_HDMI_IN_DDR3_YCbCr/3_2_HDMI_IN_DDR3_YCbCr/HDMI_IN_DDR3_YCbCr/synthesize/HDMI_IN_DDR3_YCbCr_top_syn.fic"
pnr 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {9.09M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {9.09M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {9.09M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {9.09M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {50M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {50M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_YCbCr_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {6.06M} 
