#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu Feb 20 13:43:55 2025

set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/link_work/new-200HP/2_Demo/3_6_HDMI_IN_DDR3_mid_filter/3_6_HDMI_IN_DDR3_mid_filter/HDMI_IN_DDR3_mid_filter/source/hdmi/outputserdes.v"
add_design "E:/link_work/new-200HP/2_Demo/3_6_HDMI_IN_DDR3_mid_filter/3_6_HDMI_IN_DDR3_mid_filter/HDMI_IN_DDR3_mid_filter/source/hdmi/rgb2tmds.v"
add_design "E:/link_work/new-200HP/2_Demo/3_6_HDMI_IN_DDR3_mid_filter/3_6_HDMI_IN_DDR3_mid_filter/HDMI_IN_DDR3_mid_filter/source/hdmi/tmds_encoder.v"
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L200H -speedgrade -6 -package FBB676
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
remove_design -verilog "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/median_filter_3x3.v"
remove_design -verilog "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/sort3.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/projection.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/box_display.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/dingceng.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_apb_cross_v1_0.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_apb_mux_v1_0.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_apb2dbi_v1_1.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_cfg_init_v1_2b.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_hard_ctrl_v1_2b.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_pll_v1_0.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_seio_intf_v1_2.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_soft_phy_v1_2.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/ips2l_pcie_top_v1_2b.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/osd_lum_bar.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/pcie.v"
remove_design -verilog "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/dingceng.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/area_bin.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/binarization.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/char_proc.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/dilate.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/erosion.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/gauss_filter.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/matrix_3x3_1bit.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/img_process/sobel.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module fram_buf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_data_ram/rtl/ipm2l_sdpram_v1_0_rcv_data_ram.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_data_ram/rtl/rcv_data_ram_init_param.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_data_ram/rtl/rcv_data_ram_Reset_Value.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_data_ram/rcv_data_ram.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_header_ram/rtl/ipm2l_sdpram_v1_0_rcv_header_ram.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_header_ram/rtl/rcv_header_ram_init_param.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_header_ram/rtl/rcv_header_ram_Reset_Value.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/rcv_header_ram/rcv_header_ram.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/retry_data_ram/rtl/ipm2l_spram_v1_0_retry_data_ram.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/retry_data_ram/rtl/retry_data_ram_init_param.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/retry_data_ram/rtl/retry_data_ram_Reset_Value.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/external_ram/retry_data_ram/retry_data_ram.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsst_rst_cross_sync_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsst_rst_debounce_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsst_rst_sync_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsst_rst_wtchdg_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_phy_mac_rdata_proc.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_rst4mcrsw_rx_init_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_rst4mcrsw_rx_rst_fsm_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_rst4mcrsw_rx_rst_initfsm_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_rst4mcrsw_rx_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_rst4mcrsw_tx_rst_fsm_v1_1.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_rst4mcrsw_tx_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/hsstl_rst4mcrsw_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsst_pipe/ips_hsst_rst_sync_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_fifo_clr_v1_3.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_pll_rst_fsm_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rst_debounce_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rst_pll_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rst_rx_v1_4.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rst_sync_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rst_tx_v1_4.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rst_v1_4.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rst_wtchdg_v1_0.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_rxlane_rst_fsm_v1_4.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_hsstlp_rst/ipm2l_hsstlp_txlane_rst_fsm_v1_4.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_pcie_hsstlp_apb_bridge_v1_2.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/rtl/ipm2l_pcie_hsstlp_wrapper_v1_4.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/ipm2l_pcie_hsstlp_x1_top.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/ipm2l_pcie_hsstlp_x2_top.v"
add_design "E:/BaiduNetdiskDownload/2026FPGA_ZIGUANG_DOCUMENTS/OG50K_documents/PCIE/pcie_test_platform_v1_0/pango_pcie_dma_alloc/pcie_test_rtl/PG2L100H_PCIe_DMA/ipcore/pcie/rtl/hsstlp/ipm2l_pcie_hsstlp_x4_top.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_gauss_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module projection
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module projection
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module projection
synthesize -ads -selected_syn_tool_opt 2 
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/ipcore/fifo_line_buf_1bit/fifo_line_buf_1bit.idf"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module projection
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module projection
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module projection
synthesize -ads -selected_syn_tool_opt 2 
remove_design -verilog "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/rtl/HDMI_IN_DDR3_mid_filter_top.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/top.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/async_fifo_video.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module box_display
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module box_display
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module box_display
synthesize -ads -selected_syn_tool_opt 2 
remove_design -verilog "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/top.v"
add_design "E:/BaiduNetdiskDownload/FPGAlocal_experiment/kaifaziliao/local experiment/35_HDMI_IN_DDR3_mid_filter/source/main.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module main
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module rgb2tmds
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module HDMI_IN_DDR3_mid_filter_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -master_configuration_clock_frequency {40M} 
