#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Wed Aug 13 13:33:03 2025
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"

add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/image_pcie_capture.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/ddr3/ddr3.idf"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/ddr_axi256_burst_engine.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/mem_axi_burst_ctrl_core.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/cmos_write_req_gen.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/burst_readwrite_processor.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/mem_read_arbiter.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/mem_write_arbiter.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/burst_image_fifo_reader.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/frame_ddr3/burst_image_fifo_writer.v"
add_design D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/afifo_16i_128o_512/afifo_16i_128o_512.idf
add_design D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/afifo_128i_128o_512/afifo_128i_128o_512.idf
add_design "../source/pcie/pcie_dma_core.v"
add_design "../source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
add_design "../source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
add_design "../source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
add_constraint "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/project.fdc"
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/pcie_test.idf"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_core.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ipm_distributed_sdpram_v1_2.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_expd_apb_mux.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_controller.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_cpld_tx_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_mrd_tx_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_mwr_tx_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rd_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rx_cpld_wr_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rx_mwr_wr_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rx_top.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tlp_rcv.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tlp_tx_mux.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tx_cpld_rd_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tx_mwr_rd_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tx_top.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_wr_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/pgs_pciex4_prefetch_fifo_v1_2.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_expd_apb_mux.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/fifo/ipm_distributed_sdpram_v1_2_distributed_fifo.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/fifo/pgs_pciex4_fifo_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/fifo/pgs_pciex4_fifo_v1_2.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/ips2l_pcie_dma_ram.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ipm2l_sdpram_v1_1_ips2l_pcie_dma_ram.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ips2l_pcie_dma_ram_init_param.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ips2l_pcie_dma_ram_Reset_Value.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/ips2l_pcie_dma.v"
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rx_top.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_controller.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tx_top.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_cpld_tx_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_mrd_tx_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_mwr_tx_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/ips2l_pcie_dma_ram.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rx_mwr_wr_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tlp_rcv.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rx_cpld_wr_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tx_cpld_rd_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tx_mwr_rd_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_wr_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_rd_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ipm2l_sdpram_v1_1_ips2l_pcie_dma_ram.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ipm_distributed_sdpram_v1_2.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_tlp_tx_mux.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/pgs_pciex4_prefetch_fifo_v1_2.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/pgs_pciex4_prefetch_fifo_v1_2.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/pgs_pciex4_prefetch_fifo_v1_2.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/fifo/pgs_pciex4_fifo_ctrl.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/fifo/ipm_distributed_sdpram_v1_2_distributed_fifo.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/fifo/pgs_pciex4_fifo_v1_2.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ipm_distributed_sdpram_v1_2.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_expd_apb_mux.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_cpld_tx_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_mrd_tx_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_mwr_tx_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_rd_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_rx_cpld_wr_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_rx_mwr_wr_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_tlp_rcv.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_tx_cpld_rd_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_tx_mwr_rd_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/pcie_dma_tx_top_core.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_wr_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/pgs_pciex4_prefetch_fifo_v1_2.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/fifo/ipm_distributed_sdpram_v1_2_distributed_fifo.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/fifo/pgs_pciex4_fifo_ctrl.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/fifo/pgs_pciex4_fifo_v1_2.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_ram/ips2l_pcie_dma_ram.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ipm2l_sdpram_v1_1_ips2l_pcie_dma_ram.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ips2l_pcie_dma_ram_init_param.v"
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/project/ipcore/clk_1080p_gen/clk_1080p_gen.idf
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/HDMI/hdmi_lcd_panel_driver.v"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/01_img_pcie_capture/source/HDMI/hdmi_lcd_timing_parameters.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/axi_ctrl/bus_axi4_management_unit.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/pcie/pcie_dma_ctrl/ips2l_expd_apb_mux.v"
remove_design D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/pcie_test/pcie_test.idf
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/pcie_test/pcie_test.idf"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/aq_axi_master_256_burst.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/axi_ctrl_256_burst.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/cmos_write_req_gen.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/mem_read_arbi.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/frame_read_write_256_burst.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/frame_fifo_read_256_burst.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/mem_write_arbi.v"
remove_design -verilog "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/source/frame_ddr3/frame_fifo_write_256_burst.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/R_FIFO_128i_128o/R_FIFO_128i_128o.idf"
add_design "D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/W_FIFO_16i_128o/W_FIFO_16i_128o.idf"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
remove_design -force D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/W_FIFO_16i_128o/W_FIFO_16i_128o.idf
remove_design -force D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/R_FIFO_128i_128o/R_FIFO_128i_128o.idf
add_design D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/W_FIFO_16i_128o/W_FIFO_16i_128o.idf
add_design D:/Desktop/work_material/RK_learning/RK3568_MES2L50H/05-work_material/03_FPGA_Project/02_img_pcie_capture/project/ipcore/R_FIFO_128i_128o/R_FIFO_128i_128o.idf
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design D:/Desktop/video_class/camera_demo/FPGA_project/03_camera_pcie_capture_fmc/project/ipcore/pll/pll.idf
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/03_camera_pcie_capture_fmc/source/cmos_pixel_width_adapter.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/03_camera_pcie_capture_fmc/source/simple_i2c_master_ctrl.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/03_camera_pcie_capture_fmc/source/ov5640_capture_manager.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/03_camera_pcie_capture_fmc/source/sys_pwseq_delay_circuit.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/03_camera_pcie_capture_fmc/source/sensor_reg_cfg_mgr.v"
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/ddr_axi256_master.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/ddr_axi256_burst_engine.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/mem_axi_control_hub.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/mem_axi_burst_ctrl_core.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/cmos_write_req_gen.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/image_fifo_reader.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/burst_image_fifo_reader.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/sfp_frame_fifo_reader.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/image_fifo_writer.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/burst_image_fifo_writer.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/frame_data_readwrite_ctrl.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/burst_readwrite_processor.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/sfp_frame_readwrite_core.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/mem_read_arbiter.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/frame_ddr3/mem_write_arbiter.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "../source/user/img_data_stream_reducer.v"
add_design "D:/Desktop/video_class/camera_demo/FPGA_project/05_camera_pcie_capture_40pin/source/user/pcie_image_channel_selector.v"
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L50H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module image_pcie_capture
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/axi_ctrl/bus_axi4_management_unit.v"
remove_design E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/project/ipcore/clk_1080p_gen/clk_1080p_gen.idf
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/HDMI/hdmi_lcd_panel_driver.v"
add_design "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/dl_fpga_prj.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/HDMI/hdmi_lcd_panel_driver.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/ov5640_capture_manager.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/frame_ddr3/frame_data_readwrite_ctrl.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/frame_ddr3/sfp_frame_fifo_reader.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/frame_ddr3/mem_axi_control_hub.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/axi_ctrl/bus_axi4_management_unit.v"
remove_design E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/project/ipcore/clk_1080p_gen/clk_1080p_gen.idf
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/frame_ddr3/sfp_frame_readwrite_core.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/frame_ddr3/ddr_axi256_master.v"
remove_design E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/project/ipcore/W_FIFO_16i_128o/W_FIFO_16i_128o.idf
remove_design E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/project/ipcore/R_FIFO_128i_128o/R_FIFO_128i_128o.idf
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/frame_ddr3/image_fifo_writer.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/frame_ddr3/image_fifo_reader.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ips2l_pcie_dma_ram_init_param.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/project/ipcore/pcie_test/example_design/rtl/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ips2l_pcie_dma_ram_Reset_Value.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma_ram/rtl/ips2l_pcie_dma_ram_init_param.v"
remove_design -verilog "E:/10.29/2/05_camera_pcie_capture_40pin_100k/05_camera_pcie_capture_40pin_100k/source/HDMI/hdmi_lcd_timing_parameters.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
add_design "E:/10.29-2/dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/dl/project/ipcore/hsst_tran_video/hsst_tran_video.idf
add_design "D:/PDSapp/dl/dl/project/source/word_align.v"
add_design "D:/PDSapp/dl/dl/project/source/video_packet_rec.v"
add_design D:/PDSapp/dl/dl/project/ipcore/fifo_2048_32i_16o/fifo_2048_32i_16o.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/PDSapp/dl/dl/project/source/color_bar.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
add_fic "D:/PDSapp/dl/dl/project/synthesize/dl_fpga_prj_syn.fic"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/PDSapp/dl/dl/project/source/video_scale_process.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_design -force -verilog "D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/final_dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_tlp_multiplexer.v"
remove_design -force -verilog "D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/final_dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_rx_top_core.v"
remove_design -force -verilog "D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/final_dl/dl/source/pcie/pcie_dma_ctrl/pcie_dma_ctrl_unit.v"
remove_design -force -verilog "D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/final_dl/dl/project/source/color_bar.v"
remove_design -force -verilog "D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/final_dl/dl/project/source/video_scale_process.v"
remove_design -force -verilog "D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/final_dl/dl/source/pcie/pcie_dma_ctrl/ips2l_pcie_dma.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_design "D:/HardWare_Project/FPGA/HardWare_Project/RK3568_MES2L100H/final_dl/dl/project/source/iamge_fliter.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module cmos_pixel_width_adapter
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "D:/Users/Lenovo/Desktop/DL_HDMI40IN_PCIE_RK3568_1/DL_HDMI40IN_PCIE_RK3568/project/synthesize/dl_fpga_prj_syn.fic"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
add_fic "D:/Users/Lenovo/Desktop/DL_HDMI40IN_PCIE_RK3568_1/DL_HDMI40IN_PCIE_RK3568/project/synthesize/dl_fpga_prj_syn.fic"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
remove_fic "D:/Users/Lenovo/Desktop/DL_HDMI40IN_PCIE_RK3568_1/DL_HDMI40IN_PCIE_RK3568/project/synthesize/dl_fpga_prj_syn.fic"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -dir {E:/pds/PDS_2022.2-SP6.4/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -dir {E:/pds/PDS_2022.2-SP6.4/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -dir {E:/pds/PDS_2022.2-SP6.4/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -dir {E:/pds/PDS_2022.2-SP6.4/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -dir {E:/pds/PDS_2022.2-SP6.4/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG484
compile -top_module dl_fpga_prj
synthesize -dir {E:/pds/PDS_2022.2-SP6.4/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -compress_bitstream true -master_configuration_clock_frequency {40M} 
